---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Shape
source: html/d63c2f48-c74c-bb2c-4f48-f3577fbb8684.htm
---
# Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Shape Property

The profile type of the duct.

## Syntax (C#)
```csharp
public ConnectorProfileType Shape { get; }
```